help = """
    Hotkeys:
        TAB - switch focus
        SHIFT+TAB - switch focus back

        CTRL+C 
        or      - exit
        CTRL+Q

        SPACE
        or      - action / accept / mark
        ENTER

Navigation also avaliable via MOUSE INPUT

Мышь должна работать. Но она не очень информативна из-за отсутствия ХОВЕР_ОВЕР-эффектов.
"""

about = """
    Film Seeker v0.1
    by Dmitry Zaslavskiy
    2025

    Поделка для сдачи зачёта по курсу "Программирование на Python" 
    которая косит под приложение 
    для поиска фильмов в базе данных ненастоящих фильмов
    
    =D
    """
db_connection_fail_instructions = """
    Не удалось подключиться к базе данных.
    
    1) Проверьте корректность настроек подключения в файле .env (см. README.md)
    2) Убедитесь, что база данных доступна
    3) Проеверьте своё сетевое соединение

    Приложение будет закрыто.
    """

logo = """
                      :#### ## ##   W##    ##     
          ####        ,#    ## ##   ###   ###     
       #########      ,#    ## ##   ####  # #     
    W# W####### K     ,###L ## ##   ## #  # #     
   #### fW W### W#    ,#### ## ##   ## #.## #     
   ### # G# #####E    ,#    ## ##   ## ###  #     
   W,#  f W:##### #   ,#    ## ##   ##  ##  #     
   W #  #  ######jW#  ,#    ## #### ##  ##  #     
   W  # ##  # ######                              
   G  # ##  # ,#### K                             
    W W####  W##### j                             
    ### # W  W#####W##                            
    #W# #   # # #####.                            
    .  L f #  # ####W #                           
       # #   # i##### ##                       W  
     # :##   W #########                     ###  
        #.##i#L:  ##### #                  G###   
      K # j##:# # ##### .#               ###,##   
       ##  #W #:;i##########          .W##   #    
       ##. ## ## ## #####   #Wt   :#####   ###    
        ## LW ## :G K######L##  W##  W## W####    
         ####D    #  ########D  ##   ########     
          W#       #########################W     
                   .## W####################      
                    D#  .################f##      
                     LW ###W##########.  :##      
                       ###  K##   ###    ##       
                        ### ###  ###D######       
                          .W#########W#           
                                                  
                                                  
   ###  ####  #### W#  ## ####. ####              
  ## #  #### ,#### ##  #  ####  #. ##             
  #     #    ,#    ## #G  ##    #. ,#             
  ###   #### ,###; ####   ####  #. ##             
   ###  #### ,###i ####   ####  ####              
     #, #    ,#    ## ##  ##    #. ##             
     #  #    ,#    ## ,#  ##    #. ##             
  ####  #### ,#### ##  ## ####f #.  #, 
"""
